app/Controllers/Account.php

INSERT INTO `user` (`username`, `email`, `password`) VALUES ('Jow_D', 'gabify123@email.com', '12345678')
---
                {
                    $data = $this->validator->getValidated();
                    $model = model(UserModel::class);
                    $model->save($data);